<template>
  <div class="Vehicle"> 
      <header>
          <van-icon class="iconLeft" name="arrow-left" size="23px"/>
          <p class="Vetit">选择品牌</p>
      </header>
      <div class="contain">
         <van-search
            class="search-wrap"
            
            show-action
            placeholder="请输入品牌车型或车型代码搜索"
           
            >
             <!-- @search="onSearch" -->
            <div class="btn" slot="action" >搜索</div>
            <!-- @click="onSearch" -->
        </van-search>
        <!-- 字母 -->
        <div class="list">   
            <ul >
               <a  v-for="(item,index) in letter" :key="index" href="javascript:void(0)" rel="external nofollow" v-anchor="index" >{{item}}</a> 
            </ul>
        </div>

        <div class="hot">
            <p class="hotTiT">热门品牌</p>
            <ul>
                <li  v-for="(item,index) in hot" :key="index">{{item}} </li>
            </ul>
        </div>
        <!-- 全部车辆品牌 -->
        <div class="zimu"  v-for="(value, key, index) in group" :key="key"> 
                <p  :id="'anchor-'+index" class="zimuTiT item">{{key}}</p>
                <ul>
                    <!-- <router-link tag="li" v-for="item in value" :key="item.id" :to="{name:'city',params:{id:item.id}}">{{item.name}}</router-link> -->
                    <li v-for="item of value">{{item}}</li>
                </ul>
        </div>
      </div>
  </div>
</template>

<script>
export default {
    data(){
        return{
            letter:['A','B','C','D','E','F','G','H','I','J','K','L','M','N','O','P','Q','R','S','T','W','X','Y','Z'],
            hot:['大众','丰田','雪佛兰','奥迪','别克','起亚','现代','奔驰','宝马','福特'],
            group:{
                
                A:["安驰","一汽奥迪","奥迪","阿尔法罗密欧","讴歌","广汽讴歌","埃克斯卡利伯","华夏","安凯","奥克斯","奥路卡","ARCFOX","阿斯顿-马丁","奥斯莫比尔","安通","安源","安达尔"],
                B:["梅赛德斯-奔驰","双龙奔驰","福建奔驰","北京奔驰","铂驰","奔得","比德文","比亚迪","保斐利","博格达","北京吉普","北汽","北京(泰普)","北京(北旅)","北京(常州)","北京汽车","北汽威旺","北汽新能源","北汽绅宝","北汽幻速","北极星POLARIS","北京现代","布加迪","宝骏","别克","上汽通用别克","广州宝龙","宾利","波罗乃兹","邦乐","宝丽","宝马","华晨宝马","福建八闽","现代","北泉","保时捷","佰斯威","比速","东风本田","本田","广汽本田","宝沃","比亚迪客车","白云","标致","东风标致","广州标致","宝腾","北京中华","百富利","北京西马","奔达","北仑港"], 
                C:["长安","长安(跨越)","昌河","长安欧尚","长白山","长城","哈弗","长春(城市车辆)","畅达","蜀都","猎豹","乘风","楚风","赛风","程力重工","昌河铃木","长江","长江五龙","杭州长江","川江","昌佳","乘龙","长鹿","程力威","川马","恒通客车","长庆","赛特","春洲","大乘汽车","长风","长嘉","超级精灵马克","长飞","茶花","北京(昌盛)","驰峰"],
                D:["迪赛","大迪","大地","众泰","北汽道达","天津达路","大发","一汽大发","一汽吉林","东风","东风雪铁龙","郑州东风","东风客车","南充东风","云南东风","东风风行","杭州东风","东风(东风股份)","俊风","东风小康","东风风度","东方","东风风神","达福迪","东风雷诺","东风富康","东华","大汉","德金马","电咖","大力","大马","东铭","东南","东南三菱","东鸥","达契亚","道奇","克莱斯勒","东南道奇","多士星","上汽大通","东吴","大宇","双龙","中通客车","东宇","达宇","成都大运","典悦","云度","上汽大众","一汽大众","大众","达夫利亚","东蕾","大桥","大富豪"],
                E:["峨嵋","峨眉山"],
                F:["佛山飞驰","富诚","泰汽","福达","福迪","飞碟","伏尔加","风华","飞鹤","福建","福汽启腾","法拉利","汇众","飞球","法瑞德","菲斯科","天津一汽丰田","丰田","四川一汽丰田","华泰","广汽丰田","长安福特","福特","江铃福特","水星","福田","福田雷沃","飞翼","菲亚特","蓝旗亚","南京菲亚特","广汽菲亚特","飞燕","富园","福莱纳","富龙","飞驼"],
                G:["光冈","国金汽车","国机智骏","广客","桂林","桂林五菱","桂林大宇","贵龙","广汽客车","广汽传祺","广汽","广汽新能源","广生","广通","桂通","广通客车","贵州航天","贵州","观致","中兴","黑豹(富桑)","鼓山"],
                H:["华北","华川","泓驰","华晨雷诺","华晨雷诺金杯","华东","浩达","环达","哈尔滨","哈飞","华丰","沪光","湖光","黄海","黄河","汉江","合客","恒乐","汉龙","一汽华利","环菱","华龙","华菱之星","沪陵","悍马","悍霸","海马","海南马自达","郑州海马","豪曼","湖南","美鹿","华普","英伦","红桥","一汽红旗","一汽奔腾","一汽欧朗","华骐","恒润","衡山","华狮","华颂","华泰现代","汉腾","华西","华翔富奇","华新","红星","双环红星","恒信致远","红叶","鸿雁(济南)","宏远","海粤","华阳","鸿运","上海客车","华中","华宇","海玉","华牌","皇后"],
                I:["爱雷德","爱乐提艾"],
                J:["金盾","吉奥","捷豹","奇瑞捷豹","金杯","华晨鑫源金杯","金程","聚尘王","一汽大众捷达","解放","解放(一汽吉林)","解放(一汽红塔)","解放(一汽哈轻)","解放(一汽大连)","太湖","解放(一汽成都)","金芙蓉","金刚石","江淮","京华","江环","金华奥","吉江","建康","久龙","吉利","吉利帝豪","全球鹰","知豆","金南","广汽菲克Jeep","吉普","九瑞","金沙田","赛家","嘉泰","京通","九通汽车","江天","捷途","骏威","江西","江西钧天","江西五十铃","金燕","九洲","江苏九州","剑南","箭牌","金徽","金梭","九龙","坚盾","江北","深圳金冠","江都"],
                K:["康迪","嘉龙","江铃","上汽通用凯迪拉克","凯迪拉克","北京克莱斯勒","东南克莱斯勒","快乐","凯伦宾威","科尼赛克","开瑞","魁士","卡升","凯特","克特姆","科威达","卡威","开沃","凯翼","凯旋","康福佳","卡特汉姆","凯麓"],
                L:["陆风","金龙","海格(苏州金龙)","金旅","南京金龙","兰博基尼","兰驰","拉达","乐达","龙帝","陆地方舟","雷丁","力帆(重庆)","力帆(乘用车)","MG罗孚","罗孚","罗夫哈特","灵光","路特斯(莲花)","路虎","奇瑞捷豹路虎","蓝箭","龙江(黑龙江)","雷克萨斯","林肯","凌空","兰凯","领克","兰陵","铃木","黎明","雷诺","三江雷诺","三星","广汽本田理念","陆平机器","零跑","劳斯莱斯","骊山","庐山","狼山","陆胜","朗世","隆鑫","洛阳","凌宇","凌扬(Yiang)","凌扬(FXB)","山东宝雅","鲁雅","绿野","领志","鹿牌","路獭","阿罗","一汽罗福","鲁青","庐州","鲁滨"],
                M:["马自达","吉姆西","青岛金马","申龙骏马","军马","晶马","君马","江南","长安铃木","迈巴赫","牡丹","迈迪","摩根","MG名爵","马可","迈凯轮","迷你","玛莎拉蒂","精灵Smart","摩天","天汽美亚","梅亿","一汽马自达","长安马自达","莫斯科人","牧羊","民族"],
                N:["诺铂","南车时代","速达","南华","南骏","耐克萨斯","尼欧凯","南汽新雅途","南汽","女神","纳智捷","哪吒","南燕"],
                O:["欧宝","欧铃","欧旅","欧联","欧拉","沃尔沃","沃尔沃亚太","长安沃尔沃","奥斯汀"],
                P:["旁太克","帕加尼","培新"],
                Q:["侨星","奇观","启辰","齐驰","奇点","庆铃(五十铃)","齐鲁","扬州强力","青年莲花","乔牌","奇瑞","前途","东风悦达起亚","起亚","青岩","祺智","广汽三菱祺智","乔治-巴顿","秦星","青怡"],
                R:["日产","东风日产","郑州日产","瑞驰","润长","如虎","瑞麒","荣威"],
                S:["赛宝","沙洲","山丹","赛昂","萨博","斯巴鲁","舒驰","山川","三达","山地","四达","顺达","三峰","沈飞","时风","双环","山花","上海汽车","世爵","神剑","斯柯达","上汽大众斯柯达","三菱","北京三菱","广汽三菱","长丰三菱","三菱(中华)","少林","胜利","中顺","松辽","圣路","三力","三乐","实力","神马","星王","思铭","赛欧SPRINGO","四平","赛帕","思派朗","陕汽","上饶","赛麟迈迈","舜泰","穗通","首望","三湘","湛江三星","三兴","山西","四星","三一汽车","三友","神野","神州","苏省"],
                T:["太华","泰龙","天轮","通宝","铁风","通工","铜江","天际","通家福","泰卡特","驼铃","领途","天马","驼马","飞凤","警兴","三九","其他品牌","天津一汽","特斯拉","腾势","通田","天同","天坛","同心","土星","上汽通用五菱","柳州五菱","天越","潍柴汽车","天驹"],
                W:["万达","万丰","文峰","武工","武汉","望海","威麟","蔚来","威马汽车","王牌","魏派","五十铃","广州五十铃","万山","万山红","万通","英菲尼迪","东风英菲尼迪","深圳五洲龙","重庆五洲龙","威兹曼","瓦滋","武陵源","万发","万里"],
                X:["晓奥","西北","仙达","星达","雪佛兰","上汽通用五菱雪佛兰","金杯通用雪佛兰","上汽通用雪佛兰","先锋","新飞","西虎","湘江","新凯","星凯龙","夏利","湘陵","贵州熊猫","象牌","小鹏","新桥","星锐","赛尔比眼镜蛇","香山","雪铁龙","长安谛艾仕","新特","星途","希望","安徽西亚特","西雅特","西域","翔翼","向阳","华晨鑫源斯威","华晨鑫源","雄鹰","襄樊","新海"],
                Y:["延安","羊城","雁城","渝城","跃迪(陕西)","跃迪","云海","雨花","燕京","跃进","御捷马","御捷","迎客松","迎客","英克莱","延龙","炎龙","优力通普","延龙方舟","裕路","野马","云马","云雀","雅升","宇通","洛阳宇通","英特诺帝","南京依维柯","亚星","亚星扬子","亚星奔驰","燕兴","悦西","友谊","原野","圆易","长丰扬子","扬子江","亚洲","渝州","阳钟","易至","裕隆飞羚","伊日","银燕","云鹰","粤海","鹰牌(鹰潭)"],
                Z:["追风","中海","中大","理想","华晨中华","尊豪汇","珠江","众骄","紫琅","之诺","中汽","哲人","钻石","中天之星","征天","载通","众田","之信","中意","遵义","中誉","中宜","中植","征服"]
            
            }
        }
    },
    mounted(){
        this.CarPai()
    },
    methods:{
        CarPai(){
            var group=this.group
            // console.log(group)
            for(var i of group.A){
              console.log(i)
            }
           
        }
    }
}
</script>

<style lang="scss" scope>
     body,html{
        width: 100%;
        height: 100%;
    }
    .Vehicle{
        width:100%;
        
        header{
            width: 100%;
            height:53px;
            background: #fff;
            display: flex;
            position: fixed;
            top: 0;
            left: 0;
            z-index:1;
            .iconLeft{
                padding: 13px 0 0 15px;
            }
            .Vetit{
                width:100%;
                line-height: 53px;
                text-align: center;
                margin: 0 20px 0 0;
                font-size:17px;
                font-weight:500;
                color:rgba(51,51,51,1);
            }
        }

        .contain{
            // flex:1;
            width:100%;
           
                .search-wrap {
                    margin-top:50px; 
                    .btn {
                    flex: 34px 0;
                    margin: 0 13px;
                    color: #568efc;
                    font-size: 16px;
                    }
                }
                .list{
                    width: 100%;
                    background: #fff;
                    padding-bottom:15px; 
                    ul{
                        display: flex;
                        display: -webkit-flex;
                        // padding-left:8px;
                        flex-direction: row;
                        flex-wrap: wrap;
                    a{
                            width:40px;
                            margin:15px 0 0 12px;
                            height:40px;
                            background:rgba(219,231,255,1);
                            border-radius:3px;
                            text-align: center;
                            line-height: 40px;
                            color:rgba(86,142,252,1);
                            font-weight:500;
                        }
                    }
                }
                .hot{
                    width: 100%;
                    background: #fff;
                    padding-bottom:15px; 

                    .hotTiT{
                        // width: 100%;
                        // height:45px;
                        background:rgba(240,242,244,1);
                        font-size:16px;
                        font-family:PingFangSC-Medium,PingFangSC;
                        font-weight:500;
                        color:rgba(74,74,74,1);
                        padding: 11.5px 0 11px 15px;
                    }
                    ul{
                        display: flex;
                        display: -webkit-flex;
                        // padding-left:8px;
                        flex-direction: row;
                        flex-wrap: wrap;

                        li{
                            width:60px;
                            height:40px;
                            border-radius:4px;
                            border:1px solid rgba(204,204,204,1);
                            color:rgba(51,51,51,1);
                            text-align: center;
                            line-height: 40px;
                            margin:15px 0 0 11.5px;
                        }
                    }
                }
                .zimu{
                    width:100%;
                    .zimuTiT{
                        background:rgba(240,242,244,1);
                        font-size:16px;
                        font-family:PingFangSC-Medium,PingFangSC;
                        font-weight:500;
                        color:rgba(74,74,74,1);
                        padding: 11.5px 0 11px 15px;
                    }
                    ul{
                        width:100%;
                        li{
                            padding-left: 15.5px;
                            line-height: 45px;
                            height:45px;
                            background:rgba(255,255,255,1);
                            box-shadow:0px 1px 0px 0px rgba(229,229,229,0.6);
                        }
                    }
                }
        }

        // dispiay:flex;
    }
</style>